-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: auto
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `vantaj`
--

DROP TABLE IF EXISTS `vantaj`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `vantaj` (
  `id` int NOT NULL,
  `auto` int DEFAULT NULL,
  `type_vantaj` varchar(45) DEFAULT NULL,
  `date` date DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_auto3_idx` (`auto`),
  CONSTRAINT `fk_auto3` FOREIGN KEY (`auto`) REFERENCES `transport` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `vantaj`
--

LOCK TABLES `vantaj` WRITE;
/*!40000 ALTER TABLE `vantaj` DISABLE KEYS */;
INSERT INTO `vantaj` VALUES (1,3,'Будівельні матеріали','2022-01-15'),(2,4,'Меблі','2022-02-05'),(3,6,'Речі','2022-03-10'),(4,9,'Техніка','2022-04-20'),(5,11,'Будівельні матеріали','2022-05-05'),(6,13,'Меблі','2022-06-12'),(7,15,'Речі','2022-07-18'),(8,17,'Техніка','2022-08-25'),(9,19,'Будівельні матеріали','2022-09-30'),(10,21,'Меблі','2022-10-10'),(11,23,'Речі','2022-11-15'),(12,25,'Техніка','2022-12-20'),(13,27,'Будівельні матеріали','2023-01-05'),(14,29,'Меблі','2023-02-10'),(15,3,'Речі','2023-03-15'),(16,4,'Техніка','2023-04-20'),(17,6,'Будівельні матеріали','2023-05-01'),(18,9,'Меблі','2023-05-10'),(19,11,'Речі','2023-05-15'),(20,13,'Техніка','2023-05-20'),(21,15,'Будівельні матеріали','2023-05-22'),(22,17,'Меблі','2023-05-23'),(23,19,'Речі','2023-05-23'),(24,21,'Техніка','2023-05-23'),(25,23,'Будівельні матеріали','2022-01-16'),(26,25,'Меблі','2022-02-06'),(27,27,'Речі','2022-03-11'),(28,29,'Техніка','2022-04-21'),(29,3,'Будівельні матеріали','2022-05-06'),(30,4,'Меблі','2022-06-13'),(31,6,'Речі','2022-07-19'),(32,9,'Техніка','2022-08-26'),(33,11,'Будівельні матеріали','2022-09-30'),(34,13,'Меблі','2022-10-11'),(35,15,'Речі','2022-11-16'),(36,17,'Техніка','2022-12-21'),(37,19,'Будівельні матеріали','2023-01-06'),(38,21,'Меблі','2023-02-11'),(39,23,'Речі','2023-03-16'),(40,25,'Техніка','2023-04-21'),(41,27,'Будівельні матеріали','2023-05-22'),(42,29,'Меблі','2023-05-23'),(43,3,'Речі','2023-05-23'),(44,4,'Техніка','2023-05-23'),(45,6,'Будівельні матеріали','2022-01-16'),(46,9,'Меблі','2022-02-06'),(47,11,'Речі','2022-03-11'),(48,13,'Техніка','2022-04-21'),(49,15,'Будівельні матеріали','2022-05-06'),(50,17,'Меблі','2022-06-13'),(51,19,'Речі','2022-07-19'),(52,21,'Техніка','2022-08-26'),(53,23,'Будівельні матеріали','2022-09-30'),(54,25,'Меблі','2022-10-11'),(55,27,'Речі','2022-11-16'),(56,29,'Техніка','2022-12-21'),(57,3,'Будівельні матеріали','2023-01-06'),(58,4,'Меблі','2023-02-11'),(59,6,'Речі','2023-03-16'),(60,9,'Техніка','2023-04-21'),(61,11,'Будівельні матеріали','2023-05-22'),(62,13,'Меблі','2023-05-23'),(63,15,'Речі','2023-05-23'),(64,17,'Техніка','2023-05-23'),(65,19,'Будівельні матеріали','2022-01-16'),(66,21,'Меблі','2022-02-06'),(67,23,'Речі','2022-03-11'),(68,25,'Техніка','2022-04-21'),(69,27,'Будівельні матеріали','2022-05-06'),(70,29,'Меблі','2022-06-13'),(71,3,'Речі','2022-07-19'),(72,4,'Техніка','2022-08-26'),(73,6,'Будівельні матеріали','2022-09-30'),(74,9,'Меблі','2022-10-11'),(75,11,'Речі','2022-11-16'),(76,13,'Техніка','2022-12-21'),(77,15,'Будівельні матеріали','2023-01-06'),(78,17,'Меблі','2023-02-11'),(79,19,'Речі','2023-03-16'),(80,21,'Техніка','2023-04-21'),(81,23,'Будівельні матеріали','2023-05-22'),(82,25,'Меблі','2023-05-23'),(83,27,'Речі','2023-05-23'),(84,29,'Техніка','2023-05-23'),(85,3,'Будівельні матеріали','2022-01-16'),(86,4,'Меблі','2022-02-06'),(87,6,'Речі','2022-03-11'),(88,9,'Техніка','2022-04-21'),(89,11,'Будівельні матеріали','2022-05-06'),(90,13,'Меблі','2022-06-13'),(91,15,'Речі','2022-07-19'),(92,17,'Техніка','2022-08-26'),(93,19,'Будівельні матеріали','2022-09-30'),(94,21,'Меблі','2022-10-11'),(95,23,'Речі','2022-11-16'),(96,25,'Техніка','2022-12-21'),(97,27,'Будівельні матеріали','2023-01-06'),(98,29,'Меблі','2023-02-11'),(99,3,'Речі','2023-03-16'),(100,4,'Техніка','2023-04-21');
/*!40000 ALTER TABLE `vantaj` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-05-26 15:16:09
